In [1]:
import pandas as pd
import numpy as np

In [5]:
data = pd.read_csv(r"C:\Users\PRATYAKSH\Downloads\census09.csv")

In [7]:
data.head()

,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
0,1,Rhubarb Drive,Amy,Hall,41,Head,Single,Female,Drilling engineer,None,Catholic
1,1,Rhubarb Drive,Bruce,Murphy,49,Partner,Single,Male,"Scientist, research (physical sciences)",None,Catholic
2,1,Rhubarb Drive,Billy,Hall,17,Son,NaN,Male,Student,None,NaN
3,1,Rhubarb Drive,Mary,Hall,15,Daughter,NaN,Female,Student,None,NaN
4,1,Rhubarb Drive,Elliott,Hall,13,Son,NaN,Male,Student,None,NaN

In [9]:
data.shape

(9728, 11)

In [10]:
pd.options.display.max_rows = 50

data

,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
0,1,Rhubarb Drive,Amy,Hall,41,Head,Single,Female,Drilling engineer,None,Catholic
1,1,Rhubarb Drive,Bruce,Murphy,49,Partner,Single,Male,"Scientist, research (physical sciences)",None,Catholic
2,1,Rhubarb Drive,Billy,Hall,17,Son,NaN,Male,Student,None,NaN
3,1,Rhubarb Drive,Mary,Hall,15,Daughter,NaN,Female,Student,None,NaN
4,1,Rhubarb Drive,Elliott,Hall,13,Son,NaN,Male,Student,None,NaN
...,...,...,...,...,...,...,...,...,...,...,...
9723,1,Taylor Barracks,Anne,Turner,42,Head,Married,Female,Operational researcher,None,None
9724,1,Taylor Barracks,Graham,Turner-Rose,44,Husband,Married,Male,"Presenter, broadcasting",None,None
9725,1,Taylor Barracks,William,Turner-Rose,20,Son,Single,Male,University Student,None,None
9726,1,Taylor Barracks,Rita,Turner-Rose,14,Daughter,NaN,Female,Student,None,NaN
9727,1,Taylor Barracks,Terry,Turner-Rose,12,Son,NaN,Male,Student,None,NaN

In [11]:
data.describe()

       House Number
count   9728.000000
mean      41.165090
std       47.339542
min        1.000000
25%       10.000000
50%       24.000000
75%       48.000000
max      230.000000

In [12]:
    data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9728 entries, 0 to 9727
Data columns (total 11 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   House Number                   9728 non-null   int64
 1   Street                         9728 non-null   object
 2   First Name                     9728 non-null   object
 3   Surname                        9728 non-null   object
 4   Age                            9728 non-null   object
 5   Relationship to Head of House  9728 non-null   object
 6   Marital Status                 7455 non-null   object
 7   Gender                         9728 non-null   object
 8   Occupation                     9728 non-null   object
 9   Infirmity                      9728 non-null   object
 10  Religion                       7386 non-null   object
dtypes: int64(1), object(10)
memory usage: 836.1+ KB

In [13]:
data.isna().sum()

House Number                        0
Street                              0
First Name                          0
Surname                             0
Age                                 0
Relationship to Head of House       0
Marital Status                   2273
Gender                              0
Occupation                          0
Infirmity                           0
Religion                         2342
dtype: int64

In [14]:
print(data.groupby('Marital Status').describe())

               House Number                                               \
                      count       mean        std  min   25%   50%   75%
Marital Status
                        1.0   5.000000        NaN  5.0   5.0   5.0   5.0
Divorced              895.0  41.822346  47.370012  1.0  10.0  25.0  49.0
Married              2710.0  41.673801  47.754261  1.0  10.0  25.0  48.0
Single               3443.0  40.582922  47.268667  1.0  10.0  23.0  46.0
Widowed               406.0  37.201970  43.377910  1.0  10.0  23.0  41.0


                  max
Marital Status
                  5.0
Divorced        229.0
Married         230.0
Single          229.0
Widowed         218.0

In [15]:
data.groupby(['Marital Status']).Age.describe()

               count unique top freq
Marital Status
                   1      1  12    1
Divorced         895     74  36   31
Married         2710     94  43   77
Single          3443     73  18  130
Widowed          406     78  67   21

In [16]:
data.count()

House Number                     9728
Street                           9728
First Name                       9728
Surname                          9728
Age                              9728
Relationship to Head of House    9728
Marital Status                   7455
Gender                           9728
Occupation                       9728
Infirmity                        9728
Religion                         7386
dtype: int64

In [17]:
data['House Number'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208,
       209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221,
       222, 223, 224, 225, 226, 227, 228, 229, 230], dtype=int64)

In [21]:
data['Street'].unique()

array(['Rhubarb Drive', 'Moran Mission', 'Laurelline Street',
       'Wallis Rapids', 'West Lane', 'Testamentrigg Road', 'Pisces Road',
       'Winterbarrier Street', 'Willis Springs', 'Inner Street',
       'Protectoratearch Road', 'Squirrel Plains', 'Richardson Street',
       'Cancer Lane', 'Armagh Crescent', 'Mitchell Loaf', 'Tiger Point',
       'Mill Drive', 'Wright Common', 'Love Square', 'Webb Parkway',
       'Chelmsfordshot Street', 'Orchard Crescent', 'Taylor Wall',
       'Gwent Crossing', 'Anvil Crescent', 'Farthing Avenue',
       'Coin Street', 'Green Squares', 'Martin Path', 'Apricot Rapids',
       'Kelly Shoals', 'Taurus Lodge', 'Bletchley Lodge',
       'Taylor Islands', 'London Avenue', 'Egbert Key',
       'CherryChestnut Street', 'Rhubarb Tunnel', 'Perth Lane',
       'Brightonshot Lane', 'Marsh Lights', 'Silver Road', 'Dale Glens',
       'Smith Mountain', 'Arthur Street', 'Walsh Prairie', 'Kaur Square',
       'Kelly Dale', 'Singh Plaza', 'Horse Village', 'Cook Plaza',
       'Metcalfe Forks', 'Sagittariusdike Avenue', 'Brick Crescent',
       'Horseshoe Drive', 'Ahmed Drive', 'Miller Crescent',
       'Appletree Heights', 'Beech Drive', 'Bank Street',
       'Poundsalt Crescent', 'Ford Oval', 'Bath Drive', 'Daniels Green',
       'Harris Harbor', 'Duffy Hollow', 'Guild Tunnel', 'Thistle Court',
       'Bailey Glen', 'Severn Plain', 'McLean Street', 'Taurus Drive',
       'Chester Road', 'Conifer Drive', 'Corporation Road', 'King Walks',
       'St.Luke Locks', 'Willis Avenue', 'Woods Courts', 'Roberts Drives',
       'Taurus Garden', 'Eastdeal Lane', 'Iqbal Shoals', 'Allen Forks',
       'Hunters Parkway', 'Bank Burg', 'Peel Spring', 'Reynolds Highway',
       'ExcaliburBells Dam', 'Repton Stronghold', 'Knowles Tower',
       'Thomas Haven', 'Hope Folly', 'September Delve',
       'Bishop Obervatory', 'Marsh Hold', 'John Manorhouse', 'Smith Barn',
       'Woodward Cabin', 'Fox Windmill', 'Solstice Tower', 'Beech Villa',
       'Stephens Rectory', 'Taylor Barracks'], dtype=object)

In [22]:
data['Street'].value_counts()

Green Squares        709
Cook Plaza           689
Willis Avenue        584
Wallis Rapids        503
Richardson Street    410
                    ...
September Delve        5
Marsh Hold             5
Stephens Rectory       5
Taylor Barracks        5
Repton Stronghold      2
Name: Street, Length: 105, dtype: int64

In [23]:
data['Age'].unique()

array(['41', '49', '17', '15', '13', '7', '6', '5', '4', '2', '58', '33',
       '26', '36', '47', '51', '19', '42', '44', '8', '0', '60', '56',
       '12', '46', '30', '76', '64', '63', '62', '53', '45', '37', '10',
       '24', '3', '57', '39', '29', '27', '59', '20', '32', '18', '34',
       '21', '11', '52', '50', '85', '87', '9', '61', '35', '31', '23',
       '48', '73', '25', '88', '90', '28', '71', '69', '54', '22', '68',
       '16', '55', '67', '91', '43', '40', '38', '1', '81', '79', '14',
       '70', '77', '72', '66', '65', '84', '78', '100', '92', '93', '74',
       '83', '75', '105', '82', '89', '86', '103', '80', '96', '102',
       '98', '97', '95.20845345950883', '97.20845345950883',
       '46.99999999999999', '104', '110', '101', '99',
       '50.68642589738663', '0.0', '71.70511965460919',
       '74.70511965460919', '13.0', '84.3600933267044', ' ',
       '78.78623363918231', '30.0', '27.0', '24.0', '94', '109'],
      dtype=object)

In [30]:
data['Age'] = data['Age'].replace(['95.20845345950883', '97.20845345950883', '46.99999999999999','50.68642589738663','0.0','71.70511965460919',  '74.70511965460919','13.0', '84.3600933267044','78.78623363918231', '30.0',' ', '27.0', '24.0'], " ")

In [31]:
data['Age'].unique()

array(['41', '49', '17', '15', '13', '7', '6', '5', '4', '2', '58', '33',
       '26', '36', '47', '51', '19', '42', '44', '8', '0', '60', '56',
       '12', '46', '30', '76', '64', '63', '62', '53', '45', '37', '10',
       '24', '3', '57', '39', '29', '27', '59', '20', '32', '18', '34',
       '21', '11', '52', '50', '85', '87', '9', '61', '35', '31', '23',
       '48', '73', '25', '88', '90', '28', '71', '69', '54', '22', '68',
       '16', '55', '67', '91', '43', '40', '38', '1', '81', '79', '14',
       '70', '77', '72', '66', '65', '84', '78', '100', '92', '93', '74',
       '83', '75', '105', '82', '89', '86', '103', '80', '96', '102',
       '98', '97', ' ', '104', '110', '101', '99', '94', '109'],
      dtype=object)

In [32]:
data['Age'].replace([" "," median age"],inplace = True)

In [33]:
data['Age'].unique()

array(['41', '49', '17', '15', '13', '7', '6', '5', '4', '2', '58', '33',
       '26', '36', '47', '51', '19', '42', '44', '8', '0', '60', '56',
       '12', '46', '30', '76', '64', '63', '62', '53', '45', '37', '10',
       '24', '3', '57', '39', '29', '27', '59', '20', '32', '18', '34',
       '21', '11', '52', '50', '85', '87', '9', '61', '35', '31', '23',
       '48', '73', '25', '88', '90', '28', '71', '69', '54', '22', '68',
       '16', '55', '67', '91', '43', '40', '38', '1', '81', '79', '14',
       '70', '77', '72', '66', '65', '84', '78', '100', '92', '93', '74',
       '83', '75', '105', '82', '89', '86', '103', '80', '96', '102',
       '98', '97', '104', '110', '101', '99', '94', '109'], dtype=object)

In [35]:
data['Age'] = data['Age'].astype("int64")

In [36]:
print(data.dtypes)

House Number                      int64
Street                           object
First Name                       object
Surname                          object
Age                               int64
Relationship to Head of House    object
Marital Status                   object
Gender                           object
Occupation                       object
Infirmity                        object
Religion                         object
dtype: object

In [37]:
data['Relationship to Head of House'].unique()

array(['Head', 'Partner', 'Son', 'Daughter', 'None', 'Husband', 'Wife',
       'Grandson', 'Granddaughter', 'Lodger', 'Cousin',
       'Adopted Grandson', 'Sibling', 'Visitor', 'Adopted Son', 'Neice',
       'Adopted Granddaughter', 'Nephew', 'Adopted Daughter',
       'Step-Daughter', 'Step-Son', ' '], dtype=object)

In [38]:
data['Relationship to Head of House'] = data['Relationship to Head of House'].replace([" ",None])

In [39]:
data['Relationship to Head of House'].unique()

array(['Head', 'Partner', 'Son', 'Daughter', 'None', 'Husband', 'Wife',
       'Grandson', 'Granddaughter', 'Lodger', 'Cousin',
       'Adopted Grandson', 'Sibling', 'Visitor', 'Adopted Son', 'Neice',
       'Adopted Granddaughter', 'Nephew', 'Adopted Daughter',
       'Step-Daughter', 'Step-Son'], dtype=object)

In [40]:
data['Marital Status'].unique()

array(['Single', nan, 'Married', 'Widowed', 'Divorced', ' '], dtype=object)

In [41]:
data['Marital Status'] = data['Marital Status'].replace([" "],np.nan)

In [42]:
data['Marital Status'].unique()

array(['Single', nan, 'Married', 'Widowed', 'Divorced'], dtype=object)

In [45]:
filt = data['Marital Status'].isna()
marital_data = data[filt]

In [46]:
marital_data["Occupation"].unique()

array(['Student', 'Child'], dtype=object)

In [47]:
marital_data["Age"].unique()

array([17, 15, 13,  7,  6,  5,  4,  2,  8,  0, 12, 10,  3, 11,  9, 16,  1,
       14, 60, 18], dtype=int64)

In [49]:
df = data[["Marital Status","Occupation"]]
df

     Marital Status                               Occupation
0            Single                        Drilling engineer
1            Single  Scientist, research (physical sciences)
2               NaN                                  Student
3               NaN                                  Student
4               NaN                                  Student
...             ...                                      ...
9723        Married                   Operational researcher
9724        Married                  Presenter, broadcasting
9725         Single                       University Student
9726            NaN                                  Student
9727            NaN                                  Student

[9728 rows x 2 columns]

In [50]:
data['Marital Status'].replace([np.nan,'Single'],inplace= True)

In [51]:
data['Marital Status'].unique()

array(['Single', 'Married', 'Widowed', 'Divorced'], dtype=object)

In [64]:
# data[[data['Age']==60] & [data['Marital Status']=='Single']]

In [53]:
data['Gender'].unique()

array(['Female', 'Male', ' '], dtype=object)

In [55]:
data['Gender'].replace([" ","Un-Stated"], inplace = True)

In [56]:
data['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [68]:
single = data[data['Marital Status']=='Single']
single

,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
0,1,Rhubarb Drive,Amy,Hall,41,Head,Single,Female,Drilling engineer,None,Catholic
1,1,Rhubarb Drive,Bruce,Murphy,49,Partner,Single,Male,"Scientist, research (physical sciences)",None,Catholic
2,1,Rhubarb Drive,Billy,Hall,17,Son,Single,Male,Student,None,NaN
3,1,Rhubarb Drive,Mary,Hall,15,Daughter,Single,Female,Student,None,NaN
4,1,Rhubarb Drive,Elliott,Hall,13,Son,Single,Male,Student,None,NaN
5,1,Rhubarb Drive,Clifford,Hall,7,Son,Single,Male,Student,None,NaN
6,1,Rhubarb Drive,Kirsty,Hall,6,Daughter,Single,Female,Student,None,NaN
7,1,Rhubarb Drive,Nathan,Hall,5,Son,Single,Male,Student,None,NaN
8,1,Rhubarb Drive,Sophie,Hall,4,Daughter,Single,Female,Child,None,NaN
9,1,Rhubarb Drive,Sarah,Hall,2,Daughter,Single,Female,Child,None,NaN
10,2,Rhubarb Drive,Terry,Doherty,58,Head,Single,Male,Arts administrator,None,Christian
11,2,Rhubarb Drive,Raymond,Carter,33,None,Single,Male,Electrical engineer,None,None
12,2,Rhubarb Drive,Ryan,Farrell,26,None,Single,Male,"Psychologist, occupational",None,None
13,2,Rhubarb Drive,Bethany,Jones,36,None,Single,Female,"Surveyor, land/geomatics",None,Catholic
14,2,Rhubarb Drive,Kieran,Wood,47,None,Single,Male,"Programme researcher, broadcasting/film/video",None,Catholic

In [69]:
#Isolating Single with Age above 18

single = single[single.Age > 18]
single

,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
0,1,Rhubarb Drive,Amy,Hall,41,Head,Single,Female,Drilling engineer,None,Catholic
1,1,Rhubarb Drive,Bruce,Murphy,49,Partner,Single,Male,"Scientist, research (physical sciences)",None,Catholic
10,2,Rhubarb Drive,Terry,Doherty,58,Head,Single,Male,Arts administrator,None,Christian
11,2,Rhubarb Drive,Raymond,Carter,33,None,Single,Male,Electrical engineer,None,None
12,2,Rhubarb Drive,Ryan,Farrell,26,None,Single,Male,"Psychologist, occupational",None,None
13,2,Rhubarb Drive,Bethany,Jones,36,None,Single,Female,"Surveyor, land/geomatics",None,Catholic
14,2,Rhubarb Drive,Kieran,Wood,47,None,Single,Male,"Programme researcher, broadcasting/film/video",None,Catholic

In [70]:
single.loc[0,['Marital Status']] = 'Married'

In [72]:
widowed = data[data['Marital Status'] == 'Widowed']
widowed

,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
34,5,Rhubarb Drive,Clare,Campbell,51,Lodger,Widowed,Female,"Engineer, automotive",None,None
35,5,Rhubarb Drive,Howard,Clark,46,Cousin,Widowed,Male,Rural practice surveyor,None,Jewish
36,5,Rhubarb Drive,Alexandra,Brown,30,Cousin,Widowed,Female,Event organiser,None,None
65,9,Rhubarb Drive,Alexander,Jackson,63,Lodger,Widowed,Male,Music therapist,None,Christian
66,9,Rhubarb Drive,Molly,Khan,27,Lodger,Widowed,Female,"Development worker, community",None,Christian
...,...,...,...,...,...,...,...,...,...,...,...
9556,32,Reynolds Highway,Amanda,Morris,70,Head,Widowed,Female,Unemployed,None,Christian
9557,32,Reynolds Highway,Martin,Morris,39,Son,Widowed,Male,Minerals surveyor,None,None
9680,1,Woodward Cabin,Rita,Henry,38,Lodger,Widowed,Female,Mechanical engineer,None,None
9681,1,Woodward Cabin,Deborah,Begum,59,Lodger,Widowed,Female,Human resources officer,None,Christian
9682,1,Woodward Cabin,Liam,Glover,40,Lodger,Widowed,Male,Chartered legal executive (England and Wales),None,None

In [73]:
data['Occupation'].unique()

array(['Drilling engineer', 'Scientist, research (physical sciences)',
       'Student', ..., 'Retired Secretary/administrator',
       'Retired Occupational hygienist',
       'Retired Research scientist (life sciences)'], dtype=object)

In [75]:
data['Occupation'].isna().sum()

0

In [77]:
data[data['Occupation'] == ' ']

,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
8563,205,Willis Avenue,Bernard,Williams,21,Head,Married,Male,,None,Methodist

In [80]:
data.loc[8563,['Occupation']] = 'Unstated'

In [81]:
data['Infirmity'].unique()

array(['None', 'Deaf', 'Blind', 'Physical Disability', ' ', 'Disabled',
       'Mental Disability', 'Unknown Infection'], dtype=object)

In [82]:
data['Infirmity'].replace([' '],"Unstated",inplace=True)

In [83]:
data['Religion'].unique()

array(['Catholic', nan, 'Christian', 'None', 'Methodist', 'Jewish',
       'Muslim', 'Sikh', 'Jedi', 'Bahai', 'Quaker', 'Pagan', ' ',
       'Housekeeper'], dtype=object)

In [84]:
data['Religion'].replace([' ',np.nan],["Unstated","Unstated"],inplace=True)

In [85]:
data['Religion'].value_counts()

None           3219
Unstated       2343
Christian      2261
Catholic       1034
Methodist       636
Muslim          120
Sikh             68
Jewish           37
Quaker            3
Jedi              2
Bahai             2
Pagan             2
Housekeeper       1
Name: Religion, dtype: int64